app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (title ILIKE '%SDasd%' OR author ILIKE '%SDasd%' OR genre ILIKE '%SDasd%') ORDER BY "books"."created_at" DESC
SELECT "books"."genre" FROM "books"
---
  def index
    @books = Book.includes(:user, :reviews)
                 .search(params[:search])
                 .order(created_at: :desc)

    # Фильтрация по жанру
    if params[:genre].present?
      @books = @books.where("genre ILIKE ?", "%#{params[:genre]}%")
    end

    # Собираем все жанры для фильтра
    @genres = Book.pluck(:genre).compact.uniq.sort

INSERT INTO "books" ("title", "author", "publisher", "year", "edition", "genre", "description", "url", "user_id", "created_at", "updated_at") VALUES ('dfgdf', 'dfgdg', 'dfgdfg', 2025, '1111', 'asdf', 'sdfsdfsdf', '', 1, '2025-12-14 17:45:32.158951', '2025-12-14 17:45:32.158951') RETURNING "id"
---
  def create
    @book = Book.new(book_params)
    @book.user = current_user

    respond_to do |format|
      if @book.save

UPDATE "books" SET "url" = 'https://imo10.labirint.ru/books/660825/cover.jpg/2000-0', "updated_at" = '2025-12-20 11:47:38.220505' WHERE "books"."id" = 3
---
  def update
    respond_to do |format|
      if @book.update(book_params)