app/controllers/movies_controller.rb

  def index
    @movies = Movie.includes(:user, :reviews)
                   .search(params[:search])
                   .order(created_at: :desc)

    if params[:genre].present?
      @movies = @movies.where("genre ILIKE ?", "%#{params[:genre]}%")
    end

    if params[:country].present?
      @movies = @movies.where("country ILIKE ?", "%#{params[:country]}%")
    end

    @genres = Movie.pluck(:genre).compact.uniq.sort
    @countries = Movie.pluck(:country).compact.uniq.sort
---
SELECT "movies".* FROM "movies" ORDER BY "movies"."created_at" DESC
SELECT "movies"."genre" FROM "movies"
SELECT "movies"."country" FROM "movies"

  def create
    @movie = Movie.new(movie_params)
    @movie.user = current_user

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "director", "screenwriter", "producer", "year", "genre", "description", "url", "duration", "country", "studio", "user_id", "created_at", "updated_at") VALUES ('fdsdfgs', 'dfgdfghsdgfh', 'sdgfdfsgsgfd', 'dsfgsdgfsdfg', 2025, 'sfdaasgfd', 'fsdgdfabhdgnbgrsbsgfbsfgbsfgbsfgbfsgb', '', 123, 'gafgfdsgfd', 'sfdgdfgas', 1, '2025-12-14 17:11:38.571846', '2025-12-14 17:11:38.571846') RETURNING "id"

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "url" = 'https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/21b43ae0-4d74-4842-87eb-90ace1440cbc/1920x', "updated_at" = '2025-12-20 11:46:40.856460' WHERE "movies"."id" = 2

  def destroy
    @movie.destroy!
---
DELETE FROM "movies" WHERE "movies"."id" = 1