app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" ORDER BY "reviews"."created_at" DESC
---
  def index
    @reviews = Review.includes(:user, :reviewable).order(created_at: :desc)

INSERT INTO "reviews" ("rating", "text", "user_id", "reviewable_type", "reviewable_id", "created_at", "updated_at") VALUES (4, 'Супер фильм советую к просмотру!', 5, 'Movie', 1, '2025-12-14 18:36:53.951648', '2025-12-14 18:36:53.951648') RETURNING "id"
---
  def create
    @review = @reviewable.reviews.new(review_params)
    @review.user = current_user  # Привязываем отзыв к текущему пользователю

    if @review.save

UPDATE "reviews" SET "text" = 'Супер книга!
---
  def update
    if @review.update(review_params)

DELETE FROM "reviews" WHERE "reviews"."id" = 2
---
  def destroy
    @reviewable = @review.reviewable  # Сохраняем объект для редиректа
    @review.destroy

SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
SELECT "movies".* FROM "movies" WHERE "movies"."id" = 1 LIMIT 1
---
  def set_reviewable
    if params[:book_id]
      @reviewable = Book.find(params[:book_id])
    elsif params[:movie_id]
      @reviewable = Movie.find(params[:movie_id])