app/controllers/reviews_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1
---
  def show
    @review = Review.includes(:user, :reviewable).find(params[:id])